#!/usr/bin/env python
# -*- coding: utf-8 -*-
###############################################################################################################################################
############################################## Импортируем необходимые модули и данные ########################################################
###############################################################################################################################################
# Для работы с Flask
from flask import Flask, request

# Для работы с SQL
from sqlalchemy import create_engine

# Для работы с табличными данными
import pandas as pd

# Создаем строку подключения к pg
import os
from os import environ 

# Получаем переменные окружения 
USER_NAME=os.environ['LOGIN_NAME']
PG_PASSWORD=os.environ['PG_PASSWORD']
engine =  create_engine(f'postgres://{USER_NAME}:{PG_PASSWORD}@192.168.0.141:5432/{USER_NAME}')

###############################################################################################################################################
############################################## Создаем приложение Flask #######################################################################
###############################################################################################################################################

app = Flask(__name__)

@app.route("/balance")
def get_balanse():
    id = request.args.get('id')
    query = f"""
        select 
             balance
        from balance.balance
        where id = {id}
        """
    # Получаем данные из dwh
    balance_df = pd.read_sql(
        sql = query,
        con = engine
    )
    return f"{balance_df.balance[0]}"
 
if __name__ == '__main__':
    app.run(debug=True,host='0.0.0.0')
